**MAESTRÍA EN INTELIGENCIA ARTIFICIAL APLICADA**

**Curso: TC4029 - Ciencia y analítica de datos**

Tecnológico de Monterrey

Prof Grettel Barceló Alonso

**Semana 3**
Bases, almacenes y manipulación de datos

---

*   NOMBRE: KEVIN BALDERAS SÁNCHEZ
*   MATRÍCULA: A01795149

---

En esta actividad usarás la base de datos relacional `classicmodels` (MySQL), compuesta por las siguientes tablas:

*   `Customers`: almacena los datos de los clientes.
*   `Products`: almacena una lista de modelos de coches a escala.
*   `ProductLines`: almacena una lista de categorías de líneas de productos.
*   `Orders`: almacena los pedidos de venta realizados por los clientes.
*   `OrderDetails`: almacena elementos de línea de pedidos de ventas para cada pedido de ventas.
*   `Payments`: almacena los pagos realizados por los clientes en función de sus cuentas.
*   `Employees`: almacena toda la información de los empleados, así como la estructura de la organización, como quién informa a quién.
*   `Offices`: almacena los datos de la oficina de ventas.

Revisa con detalle su esquema para que comprendas cómo se relacionan las tablas anteriores.

Recuerda que:


*   Una **clave primaria** es un atributo (o conjunto) que identifica unívocamente a cada registro en la tabla.
*   Una **clave foránea** (externa o ajena) es un atributos (o conjunto) en una tabla que es una clave primaria en otra (o posiblemente la misma) tabla.
*   Las **relaciones** son las líneas que conectan una tabla con otra y el extremo determina la cardinalidad. Las relaciones con línea continua (identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser foránea y primaria (al mismo tiempo) de otra. Las relaciones con línea discontinua (no identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser sólo foránea en otra.

# **Parte 1**. SQLAlchemy y SQL básico

In [1]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     -------------------------------------- 44.8/44.8 kB 442.7 kB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

[notice] A new release of pip available: 22.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [108]:
import sqlalchemy as sqla
import pymysql
import pandas as pd

1.	Crea el motor `sqlalchemy`, con el método `create_engine()` y una conexión con `connect()` como se muestra a continuación:

In [109]:
# Crear el motor (dialecto://usuarioBD:clave@ipHostDBMS:puerto/esquema
db = sqla.create_engine('mysql+pymysql://mnaTC4029User:mnaTC4029Pass!@20.106.157.52:3306/classicmodels', pool_recycle=3600)

# Crea una conexión para luego invocar declaraciones SQL
conn = db.connect()

Escribe las consultas en SQL para obtener:

2.	La información de las líneas de productos.

In [110]:
query = "SELECT * FROM productlines"
pd.read_sql(query, db)

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,None,None
1,Motorcycles,Our motorcycles are state of the art replicas ...,None,None
2,Planes,"Unique, diecast airplane and helicopter replic...",None,None
3,Ships,The perfect holiday or anniversary gift for ex...,None,None
4,Trains,Model trains are a rewarding hobby for enthusi...,None,None
5,Trucks and Buses,The Truck and Bus models are realistic replica...,None,None
6,Vintage Cars,Our Vintage Car models realistically portray a...,None,None

3.	Los empleados ordenados por nombre.

In [111]:
query = """SELECT CONCAT(firstName,' ',lastName) AS FullName FROM employees
        ORDER BY firstName ASC """
pd.read_sql(query, db)

             FullName
0         Andy Fixter
1         Anthony Bow
2         Barry Jones
3        Diane Murphy
4      Foon Yue Tseng
5       George Vanauf
6       Gerard Bondur
7    Gerard Hernandez
8       Jeff Firrelli
9      Julie Firrelli
10         Larry Bott
11    Leslie Jennings
12    Leslie Thompson
13        Loui Bondur
14         Mami Nishi
15      Martin Gerard
16     Mary Patterson
17    Pamela Castillo
18        Peter Marsh
19    Steve Patterson
20           Tom King
21  William Patterson
22       Yoshimi Kato

4.	Los países donde hay oficinas.

In [112]:
query = """SELECT DISTINCT(country) FROM offices"""
pd.read_sql(query, db)

     country
0        USA
1     France
2      Japan
3  Australia
4         UK

5.	El nombre y teléfono de los clientes de Nueva York (*NYC*).

In [113]:
query = """SELECT customerName,phone FROM customers
            WHERE city='NYC'
            """
pd.read_sql(query, db)

           customerName       phone
0     Land of Toys Inc.  2125557818
1    Muscle Machine Inc  2125557413
2       Vitachrome Inc.  2125551500
3  Classic Legends Inc.  2125558493
4       Microscale Inc.  2125551957

6.	El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [114]:
query = """SELECT productCode, productName FROM products
            WHERE productVendor='Gearbox Collectibles' AND quantityInStock < 1000
            """
pd.read_sql(query, db)

  productCode             productName
0    S18_2581          P-51-D Mustang
1    S18_2795  1928 Mercedes-Benz SSK

7.	Los tres productos más caros, desde el punto de visto de los comercializadores (`buyPrice`).

In [115]:
query = """SELECT productName, productVendor, MAX(buyPrice) FROM products
            GROUP BY productName
            ORDER BY MAX(buyPrice) DESC
            LIMIT 3
            """
pd.read_sql(query, db)

                      productName            productVendor  MAX(buyPrice)
0          1962 LanciaA Delta 16V      Second Gear Diecast         103.42
1  1998 Chrysler Plymouth Prowler     Gearbox Collectibles         101.51
2        1952 Alpine Renault 1300  Classic Metal Creations          98.58

8.	La cantidad de productos por línea de producto (no las existencias en inventario)

In [116]:
query = """SELECT productLine, COUNT(DISTINCT(productCode)) AS ProductCodeperLine FROM products
            GROUP BY productLine
            
            """
pd.read_sql(query, db)

        productLine  ProductCodeperLine
0      Classic Cars                  38
1       Motorcycles                  13
2            Planes                  12
3             Ships                   9
4            Trains                   3
5  Trucks and Buses                  11
6      Vintage Cars                  24

9.	La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [117]:
query = """ SELECT offices.country,COUNT(*) FROM employees
            INNER JOIN offices
            ON employees.officeCode = offices.officeCode
            GROUP BY offices.country
            """
pd.read_sql(query, db)

     country  COUNT(*)
0  Australia         4
1     France         5
2      Japan         2
3         UK         2
4        USA        10

10.	El promedio de los pagos de cada uno de los clientes de España.

In [118]:
query = """ SELECT customers.customerNumber, customers.customerName, AVG(amount) AS Mean FROM customers
            INNER JOIN payments
            ON customers.customerNumber = payments.customerNumber
            WHERE customers.country = 'Spain'
            GROUP BY customers.customerNumber
            ORDER BY Mean ASC
            """
pd.read_sql(query, db)

   customerNumber                customerName          Mean
0             216          Enaco Distributors  22840.156667
1             344                 CAF Imports  23375.570000
2             484  Iberia Gift Imports, Corp.  25493.925000
3             458  Corrida Auto Replicas, Ltd  37480.030000
4             141      Euro+ Shopping Channel  55056.844615

# **Parte 2**. Manipulación de datos con Pandas

11.	Carga las tablas empleadas en dataframes con el mismo nombre y resuelve las consultas anteriores con las funciones de Pandas. Cuida no sobreescribir los dataframes originales al resolver las consultas. Debes obtener los mismos resultados que con SQL.

In [119]:
#Guardamos primero todas las tablas en dfs
df_productlines = pd.read_sql('SELECT * FROM productlines', db)
df_customers = pd.read_sql('SELECT * FROM customers', db)
df_products = pd.read_sql('SELECT * FROM products', db)
df_employees = pd.read_sql('SELECT * FROM employees', db)
df_payments = pd.read_sql('SELECT * FROM payments', db)
df_offices = pd.read_sql('SELECT * FROM offices', db)
df_orders = pd.read_sql('SELECT * FROM orders', db)
df_order_details = pd.read_sql('SELECT * FROM orderdetails', db)

In [120]:
#2.- La información de las lineas de productos
df_productlines.head(10)

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,None,None
1,Motorcycles,Our motorcycles are state of the art replicas ...,None,None
2,Planes,"Unique, diecast airplane and helicopter replic...",None,None
3,Ships,The perfect holiday or anniversary gift for ex...,None,None
4,Trains,Model trains are a rewarding hobby for enthusi...,None,None
5,Trucks and Buses,The Truck and Bus models are realistic replica...,None,None
6,Vintage Cars,Our Vintage Car models realistically portray a...,None,None

In [121]:
#3.- Los empleados ordenados por nombre
ans = df_employees.sort_values("firstName")
ans["Full Name"] = ans["firstName"] + ' '+ans["lastName"]
ans = ans.reset_index(drop=True)
pd.DataFrame(ans['Full Name'], index=list(range(len(ans['Full Name']))))

            Full Name
0         Andy Fixter
1         Anthony Bow
2         Barry Jones
3        Diane Murphy
4      Foon Yue Tseng
5       George Vanauf
6    Gerard Hernandez
7       Gerard Bondur
8       Jeff Firrelli
9      Julie Firrelli
10         Larry Bott
11    Leslie Jennings
12    Leslie Thompson
13        Loui Bondur
14         Mami Nishi
15      Martin Gerard
16     Mary Patterson
17    Pamela Castillo
18        Peter Marsh
19    Steve Patterson
20           Tom King
21  William Patterson
22       Yoshimi Kato

In [122]:
#4.- Los paises donde hay oficinas
#En este caso, como la función groupby afecta a todos los campos numéricos, seleccionamos que queremos la columna officeCode
#debido a que no tiene nulos y tiene información relevante para hacer el conteo, pero se pudo haber utilizado otra columna
ans = df_offices.groupby("country").count()["officeCode"] 
pd.DataFrame(ans.values, index=list(ans.index), columns=['Num Oficinas'])

           Num Oficinas
Australia             1
France                1
Japan                 1
UK                    1
USA                   3

In [123]:
#5.- El nombre y telefono de los clientes de NYC
cols = ["customerName","phone","city"]
ans = df_customers[cols]
ans = ans[ans["city"]=='NYC']
ans.reset_index(drop=True)

           customerName       phone city
0     Land of Toys Inc.  2125557818  NYC
1    Muscle Machine Inc  2125557413  NYC
2       Vitachrome Inc.  2125551500  NYC
3  Classic Legends Inc.  2125558493  NYC
4       Microscale Inc.  2125551957  NYC

In [124]:
#6.- El codigo y nombre de los productos del vendedor Gearbox Collectibles que tengan menos de 1000 unidades en stock
ans = df_products[["productCode","productName","productVendor","quantityInStock"]]
ans = ans[(ans["quantityInStock"]<1000) & (ans["productVendor"]=='Gearbox Collectibles')]
ans.reset_index(drop=True)

  productCode             productName         productVendor  quantityInStock
0    S18_2581          P-51-D Mustang  Gearbox Collectibles              992
1    S18_2795  1928 Mercedes-Benz SSK  Gearbox Collectibles              548

In [125]:
#7.- Los tres productos mas caros, desde el punto de vista de los comercializadores (buyPrice)
ans = df_products.groupby("productName").max("buyPrice").sort_values("buyPrice")["buyPrice"][-1:-4:-1]
pd.DataFrame(ans.values, index=list(ans.index), columns=['Product Name'])

                                Product Name
1962 LanciaA Delta 16V                103.42
1998 Chrysler Plymouth Prowler        101.51
1952 Alpine Renault 1300               98.58

In [126]:
#8.- La cantidad de productos por linea de producto (no las existencias en inventario)
ans = df_products.groupby("productLine").nunique()["productCode"]
pd.DataFrame(ans.values, index=list(ans.index), columns=['Product per productLine'])

                  Product per productLine
Classic Cars                           38
Motorcycles                            13
Planes                                 12
Ships                                   9
Trains                                  3
Trucks and Buses                       11
Vintage Cars                           24

In [127]:
#9.- La cantidad de empleados por pais (tomando en cuentala ubicacion de la oficina)
ans = df_employees.merge(df_offices,how='inner')
ans = ans.groupby("country").nunique()["employeeNumber"]
pd.DataFrame(ans.values, index=list(ans.index), columns=['Num eployees per Country'])

           Num eployees per Country
Australia                         4
France                            5
Japan                             2
UK                                2
USA                              10

In [128]:
#10.- El promedio de los pagos de cada uno de los clientes en España
ans1 = df_customers.merge(df_payments, how='inner')
ans1 = ans1[ans1["country"]=='Spain']
ans1 = ans1.groupby("customerName").mean()['amount']
pd.DataFrame(ans1.values, index=list(ans1.index), columns=['Promedio pagos/cliente']).sort_values('Promedio pagos/cliente')

                            Promedio pagos/cliente
Enaco Distributors                    22840.156667
CAF Imports                           23375.570000
Iberia Gift Imports, Corp.            25493.925000
Corrida Auto Replicas, Ltd            37480.030000
Euro+ Shopping Channel                55056.844615

# **Parte 3**. Cliente de Python Firestore

En esta fase te conectarás a una base de datos no relacional de Firestore desde Python. Para ello utilizarás los módulos `credentials` y `firestore` de la biblioteca `firebase_admin`.

In [129]:
import firebase_admin
from firebase_admin import credentials
from firebase_admin import firestore

El archivo `veterinary.json` almacena la clave privada para autenticar una cuenta y autorizar el acceso a los servicios de Firebase. A través de la función `Certificate()`, se regresa una credencial inicializada, que puedes utilizar para crear una nueva instancia de la aplicación. Después de eso, tu conexión a Firestore utilizará las reglas de seguridad establecidas para la base de datos y el usuario autenticado.

In [13]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [14]:
import os
DIR = "/content/drive/MyDrive/Colab Notebooks/MNA/TC4029 - Ciencia y analítica de datos/Semana 3/Actividad3_BD_Manipulacion"
os.chdir(DIR)

In [132]:
cred = credentials.Certificate('veterinary.json')
firebase_admin.initialize_app(cred)
db = firestore.client()

12.	Investiga cómo leer la colección `PET_OWNER` y mostrar su contenido en un dataframe. Asegúrate de incluir el id en el resultado

In [133]:
ref = db.collection('PET_OWNER')
docs = ref.stream()
docs_fin = []

for doc in docs:
    dict_doc = doc.to_dict()
    dict_doc["id"] = doc.id
    docs_fin.append(dict_doc)

df_fire = pd.DataFrame(docs_fin)
df_fire.set_index("id")

,email,phone,ownerFirstName,ownerLastName
id,,,,
0D6yFSs2eu4nYwf2dnQ0,None,555-454-3465,Sam,Taylor
98357ufgjmWUxjnAuzbz,miles.trent@somewhere.com,None,Miles,Trent
AFtZincSZxjC4Mcxf9Pf,liz.frier@somewhere.com,555-537-6543,Liz,Frier
GYDixDwHjMyihjL8TmsM,None,555-454-1243,Jenny,Mayberry
IpxTuB6FILhwQFcspLws,'marcha.downs@somewhere.com,555-537-8765,Marsha,Downs
QoXBfS1JdRp6BqgLzaAz,None,555-454-2354,Ken,Roberts
eUtZ44lPRbSHXX04EDp7,nigel.melnik@somewhere.com,555-232-5678,Nigel,Melnik
n2GG9rlfGOmE0P4TcU0T,richard.james@somewhere.com,555-537-7654,Richard,James
pDlJlul8EJXO8FBJvFkN,jim.rogers@somewhere.com,555-232-3456,Jim,Rogers
tAlJ74xQ7tT4TUHwZgmH,mary.keenan@somewhere.com,555-232-4567,Mary,Keenan

In [131]:
firebase_admin.delete_app(firebase_admin.get_app())